In [2]:
import pandas as pd
import numpy as np

# Ways to create Dataframe objects

## From Dict

In [109]:
dict = {'id': ['00001', '00002', '00003', '00001'],
       'score': range(4)}

df1 = pd.DataFrame(dict)
print(df1)

      id  score
0  00001      0
1  00002      1
2  00003      2
3  00001      3

## From list

In [21]:
# need to convert a list to a dict
list_1 = ['00001', '00002', '00003', '00001']
list_2 = range(len(list_1))

df2 = pd.DataFrame({'id': list_1, 'score': list_2})
print(df2)

      id  score
0  00001      0
1  00002      1
2  00003      2
3  00001      3

## From Series

In [28]:
series_1 = df1['id']
series_2 = df1['score']
print(type(series_1))

# use concat on axis = 1 (columns)
df3 = pd.concat([series_1, series_2], axis = 1)
print('df3')
print(df3)

# use concat on axis = 0 (rows)
df4 = pd.concat([series_1, series_2], axis = 0)
print('df4')
print(df4)

<class 'pandas.core.series.Series'>
df3
      id  score
0  00001      0
1  00002      1
2  00003      2
3  00001      3
df4
0    00001
1    00002
2    00003
3    00001
0        0
1        1
2        2
3        3
dtype: object

## From csv file

In [57]:
df1.to_csv('./data/data1.csv')

# default method will ignore the leading zeros in id column
df5 = pd.read_csv('./data/data1.csv')
print(df5)

   Unnamed: 0  id  score
0           0   1      0
1           1   2      1
2           2   3      2
3           3   1      3

In [58]:
# use dtype arg to assgin object class to id column 
df6 = pd.read_csv('./data/data1.csv', dtype = {'id': object})
print(df6)

   Unnamed: 0     id  score
0           0  00001      0
1           1  00002      1
2           2  00003      2
3           3  00001      3

In [59]:
# ignore index 
df7 = pd.read_csv('./data/data1.csv', dtype = {'id': object}, index_col=0)
print(df7)

      id  score
0  00001      0
1  00002      1
2  00003      2
3  00001      3

# Show data structures

In [60]:
# show each column type
print(df1.loc[0].apply(type))

id               <type 'str'>
score    <type 'numpy.int64'>
Name: 0, dtype: object

In [71]:
# show dimension
print(df1.shape, df1.shape[0], df1.shape[1])

((4, 2), 4, 2)

In [65]:
# head, tail
print(df1.head(1))
print(df1.tail(1))

      id  score
0  00001      0
      id  score
3  00001      3

In [111]:
# show memory usage. not very useful
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
id       4 non-null object
score    4 non-null int64
dtypes: int64(1), object(1)
memory usage: 136.0+ bytes

In [112]:
# show basic stats
df1.describe()

          score
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

In [117]:
# show column names
# return a Index object, need to use tolist()
df1.columns.tolist()

['id', 'score']

# Modify a dataframe

In [103]:
# print index
df1.reset_index(inplace=True)
print(df1)
print(df1.index)

# set index
df1 = df1.set_index('id') #or
# df1.set_index('id', inplace=True) 
print(df1)
print(df1.index)

# reset index
df1 = df1.reset_index() #or
# df1.reset_index(inplace=True)
print(df1)
print(df1.index)

      id  score
0  00001      0
1  00002      1
2  00003      2
3  00001      3
RangeIndex(start=0, stop=4, step=1)
       score
id
00001      0
00002      1
00003      2
00001      3
Index([u'00001', u'00002', u'00003', u'00001'], dtype='object', name=u'id')
      id  score
0  00001      0
1  00002      1
2  00003      2
3  00001      3
RangeIndex(start=0, stop=4, step=1)

In [83]:
# add a column
df1['newcol']=np.random.rand(df1.shape[0])
print(df1)

      id  score    newcol
0  00001      0  0.660166
1  00002      1  0.811466
2  00003      2  0.322833
3  00001      3  0.938383

In [84]:
# delete a column
df1.drop('newcol', axis=1)

      id  score
0  00001      0
1  00002      1
2  00003      2
3  00001      3

In [85]:
# add a row
df1 = df1.append(df2[:1])
print(df1)

      id    newcol  score
0  00001  0.660166      0
1  00002  0.811466      1
2  00003  0.322833      2
3  00001  0.938383      3
0  00001       NaN      0

In [108]:
# drop a row
df1.drop(2, axis=0)

      id  score
0  00001      0
1  00002      1
3  00001      3

In [120]:
# rename a column
df1.rename(columns={'id':'ID', 'score':'SCORE'})

      ID  SCORE
0  00001      0
1  00002      1
2  00003      2
3  00001      3

In [256]:
df1 = pd.DataFrame({'id': ['00001', '00002', '00003', '00001'],
       'score': range(4)})
print(df1.info())

df1.score = df1.score.astype('object')
print(df1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
id       4 non-null object
score    4 non-null int64
dtypes: int64(1), object(1)
memory usage: 136.0+ bytes
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
id       4 non-null object
score    4 non-null object
dtypes: object(2)
memory usage: 136.0+ bytes
None

# Selection and Filter

In [144]:
# select a row by position using .iloc
print(df2.iloc[0])
print(df2.iloc[0:2,])

id       00001
score        0
Name: 0, dtype: object
      id  score
0  00001      0
1  00002      1

In [142]:
# select a row by index using .loc
df2 = df2.reset_index()
df2 = df2.set_index('id')
print(df2.loc['00001'])
df2 = df2.reset_index()

       score
id
00001      0
00001      3

In [171]:
# select columns by name
print(df2[['id', 'score']])

# select one column by name
print(df2.id)

      id  score
0  00001      0
1  00002      1
2  00003      2
3  00001      3
0    00001
1    00002
2    00003
3    00001
Name: id, dtype: object

In [160]:
# select a column by position
df2.iloc[:, 0:1]

      id
0  00001
1  00002
2  00003
3  00001

In [161]:
# select a cell by position
df2.iloc[1:3, 0:1]

      id
1  00002
2  00003

In [327]:
# filter by conditions
# each condition needs to be grouped by ()
print(df2[(df2.id == '00001') & (df2.score == 3)])

print(df2[df2.id.isin(['00001', '00002'])])

      id  score
3  00001      3
      id  score
0  00001      0
1  00002      1
3  00001      3

# Sort

In [126]:
# sort by value
df2.sort_values(['id', 'score'], ascending=[True, False])

      id  score
3  00001      3
0  00001      0
1  00002      1
2  00003      2

In [127]:
# sort by index
df2.sort_index(ascending=False)

      id  score
3  00001      3
2  00003      2
1  00002      1
0  00001      0

# Join / Append

In [344]:
# left, right, inner joins
df_j1 = pd.DataFrame({'date': pd.date_range('2016/07/25', periods=5).tolist() * 2
                  , 'ticker1': ['A']*5 + ['B']*5
                  , 'col1': np.random.rand(10)
                  , 'col2': np.random.rand(10)})
df_j2 = pd.DataFrame({'date': pd.date_range('2016/07/23', periods=5).tolist() * 2
                  , 'ticker2': ['B']*5 + ['C']*5
                  , 'col3': np.random.rand(10)
                  , 'col4': np.random.rand(10)})
print(df_j1)
print(df_j2)

print('\n\nleft join on same columns')
print(pd.merge(df_j1, df_j2, on = 'date', how='left'))
print('\n\nleft join on different columns')
print(pd.merge(df_j1, df_j2, left_on = ['date', 'ticker1'], right_on=['date', 'ticker2'], how='left'))
print('\n\ninner join')
print(pd.merge(df_j1, df_j2, left_on = ['date', 'ticker1'], right_on=['date', 'ticker2'], how='inner'))

       col1      col2       date ticker1
0  0.546507  0.177778 2016-07-25       A
1  0.006330  0.874593 2016-07-26       A
2  0.987661  0.359606 2016-07-27       A
3  0.350662  0.400968 2016-07-28       A
4  0.276316  0.284779 2016-07-29       A
5  0.665116  0.224429 2016-07-25       B
6  0.294140  0.263149 2016-07-26       B
7  0.258808  0.087036 2016-07-27       B
8  0.049309  0.088257 2016-07-28       B
9  0.391354  0.101544 2016-07-29       B
       col3      col4       date ticker2
0  0.033081  0.042507 2016-07-23       B
1  0.324510  0.145926 2016-07-24       B
2  0.833421  0.458434 2016-07-25       B
3  0.200250  0.688753 2016-07-26       B
4  0.542913  0.338160 2016-07-27       B
5  0.027381  0.079002 2016-07-23       C
6  0.568208  0.471911 2016-07-24       C
7  0.860888  0.270131 2016-07-25       C
8  0.200522  0.538169 2016-07-26       C
9  0.563490  0.131722 2016-07-27       C


left join on same columns
        col1      col2       date ticker1      col3      col4 ticker2
0   0.546507  0.177778 2016-07-25       A  0.833421  0.458434       B
1   0.546507  0.177778 2016-07-25       A  0.860888  0.270131       C
2   0.006330  0.874593 2016-07-26       A  0.200250  0.688753       B
3   0.006330  0.874593 2016-07-26       A  0.200522  0.538169       C
4   0.987661  0.359606 2016-07-27       A  0.542913  0.338160       B
5   0.987661  0.359606 2016-07-27       A  0.563490  0.131722       C
6   0.350662  0.400968 2016-07-28       A       NaN       NaN     NaN
7   0.276316  0.284779 2016-07-29       A       NaN       NaN     NaN
8   0.665116  0.224429 2016-07-25       B  0.833421  0.458434       B
9   0.665116  0.224429 2016-07-25       B  0.860888  0.270131       C
10  0.294140  0.263149 2016-07-26       B  0.200250  0.688753       B
11  0.294140  0.263149 2016-07-26       B  0.200522  0.538169       C
12  0.258808  0.087036 2016-07-27       B  0.542913  0.338160       B
13  0.258808  0.087036 2016-07-27       B  0.563490  0.131722       C
14  0.049309  0.088257 2016-07-28       B       NaN       NaN     NaN
15  0.391354  0.101544 2016-07-29       B       NaN       NaN     NaN


left join on different columns
       col1      col2       date ticker1      col3      col4 ticker2
0  0.546507  0.177778 2016-07-25       A       NaN       NaN     NaN
1  0.006330  0.874593 2016-07-26       A       NaN       NaN     NaN
2  0.987661  0.359606 2016-07-27       A       NaN       NaN     NaN
3  0.350662  0.400968 2016-07-28       A       NaN       NaN     NaN
4  0.276316  0.284779 2016-07-29       A       NaN       NaN     NaN
5  0.665116  0.224429 2016-07-25       B  0.833421  0.458434       B
6  0.294140  0.263149 2016-07-26       B  0.200250  0.688753       B
7  0.258808  0.087036 2016-07-27       B  0.542913  0.338160       B
8  0.049309  0.088257 2016-07-28       B       NaN       NaN     NaN
9  0.391354  0.101544 2016-07-29       B       NaN       NaN     NaN


inner join
       col1      col2       date ticker1      col3      col4 ticker2
0  0.665116  0.224429 2016-07-25       B  0.833421  0.458434       B
1  0.294140  0.263149 2016-07-26       B  0.200250  0.688753       B
2  0.258808  0.087036 2016-07-27       B  0.542913  0.338160       B

In [341]:
# outer join
print(pd.merge(df_j1, df_j2, left_on = ['date', 'ticker1'], right_on=['date', 'ticker2'], how='outer'))

        col1      col2       date ticker1      col3      col4 ticker2
0   0.677538  0.068540 2016-07-25       A       NaN       NaN     NaN
1   0.696433  0.382627 2016-07-26       A       NaN       NaN     NaN
2   0.938623  0.666231 2016-07-27       A       NaN       NaN     NaN
3   0.409053  0.728368 2016-07-28       A       NaN       NaN     NaN
4   0.020624  0.661935 2016-07-29       A       NaN       NaN     NaN
5   0.273285  0.777023 2016-07-25       B  0.385513  0.065311       B
6   0.438460  0.393199 2016-07-26       B  0.227504  0.733994       B
7   0.472115  0.062613 2016-07-27       B  0.282193  0.949860       B
8   0.313201  0.869183 2016-07-28       B       NaN       NaN     NaN
9   0.275836  0.615696 2016-07-29       B       NaN       NaN     NaN
10       NaN       NaN 2016-07-23     NaN  0.409867  0.921028       B
11       NaN       NaN 2016-07-24     NaN  0.016382  0.527965       B
12       NaN       NaN 2016-07-23     NaN  0.932429  0.456770       C
13       NaN       NaN 2016-07-24     NaN  0.957129  0.561273       C
14       NaN       NaN 2016-07-25     NaN  0.692604  0.340002       C
15       NaN       NaN 2016-07-26     NaN  0.842949  0.405595       C
16       NaN       NaN 2016-07-27     NaN  0.548610  0.816791       C

In [358]:
# non-equal join
# need to do a cross join + filter
df_j1['dummy'] = 1
df_j2['dummy'] = 1

df_cross = pd.merge(df_j1, df_j2, left_on=['ticker1', 'dummy'], right_on=['ticker2', 'dummy'])
print(df_cross[(df_cross.date_x > df_cross.date_y)][['ticker1', 'date_x', 'date_y']])

   ticker1     date_x     date_y
0        B 2016-07-25 2016-07-23
1        B 2016-07-25 2016-07-24
5        B 2016-07-26 2016-07-23
6        B 2016-07-26 2016-07-24
7        B 2016-07-26 2016-07-25
10       B 2016-07-27 2016-07-23
11       B 2016-07-27 2016-07-24
12       B 2016-07-27 2016-07-25
13       B 2016-07-27 2016-07-26
15       B 2016-07-28 2016-07-23
16       B 2016-07-28 2016-07-24
17       B 2016-07-28 2016-07-25
18       B 2016-07-28 2016-07-26
19       B 2016-07-28 2016-07-27
20       B 2016-07-29 2016-07-23
21       B 2016-07-29 2016-07-24
22       B 2016-07-29 2016-07-25
23       B 2016-07-29 2016-07-26
24       B 2016-07-29 2016-07-27

In [62]:
# append a dataframe
df1.append(df2)

      id  score
0  00001      0
1  00002      1
2  00003      2
3  00001      3
0  00001      0
1  00002      1
2  00003      2
3  00001      3

In [63]:
# append a dataframe using concat
pd.concat([df1, df2], axis=0)

      id  score
0  00001      0
1  00002      1
2  00003      2
3  00001      3
0  00001      0
1  00002      1
2  00003      2
3  00001      3

# Group by

In [281]:
df_t = pd.DataFrame({'date': pd.date_range('2016/07/25', periods=5).tolist() * 2
                  , 'ticker': ['A']*5 + ['B']*5
                  , 'col1': np.random.rand(10)
                  , 'col2': np.random.rand(10)})
print(df_t[['ticker', 'date', 'col1', 'col2']])

# groupby return a groupby object
df_t.groupby(['ticker'])

  ticker       date      col1      col2
0      A 2016-07-25  0.611022  0.465063
1      A 2016-07-26  0.556476  0.249893
2      A 2016-07-27  0.697348  0.834310
3      A 2016-07-28  0.868427  0.438615
4      A 2016-07-29  0.731708  0.909532
5      B 2016-07-25  0.016074  0.759305
6      B 2016-07-26  0.642525  0.526267
7      B 2016-07-27  0.799280  0.111633
8      B 2016-07-28  0.516698  0.970150
9      B 2016-07-29  0.633974  0.606188

In [305]:
# group by and apply aggregation function to columns

# group count
print(df_t.groupby(['ticker']).count())
print(df_t.groupby(['ticker']).aggregate('count'))

print(df_t.groupby(['ticker']).date.count())
print(df_t.groupby(['ticker']).size())
# group mean, median, max, min
print(df_t.groupby(['ticker']).aggregate(['count', 'mean', 'sum', 'max', 'min']))

        col1  col2  date
ticker
A          5     5     5
B          5     5     5
        col1  col2  date
ticker
A          5     5     5
B          5     5     5
ticker
A    5
B    5
Name: date, dtype: int64
ticker
A    5
B    5
dtype: int64
        col1                                          col2            \
       count      mean       sum       max       min count      mean
ticker
A          5  0.692996  3.464981  0.868427  0.556476     5  0.579483
B          5  0.521710  2.608552  0.799280  0.016074     5  0.594708


             sum       max       min
ticker
A       2.897413  0.909532  0.249893
B       2.973542  0.970150  0.111633

In [304]:
# group custom aggregate function
df_t.groupby(['ticker'])[['col1', 'col2']].apply(lambda x: np.sum(x))

            col1      col2
ticker
A       3.464981  2.897413
B       2.608552  2.973542

In [306]:
# group by and apply non-aggregation function to columns
# cumsum by group
df_t.groupby(['ticker'])[['col1', 'col2']].apply(lambda x: np.cumsum(x))

       col1      col2
0  0.611022  0.465063
1  1.167498  0.714956
2  1.864846  1.549266
3  2.733273  1.987880
4  3.464981  2.897413
5  0.016074  0.759305
6  0.658600  1.285571
7  1.457879  1.397204
8  1.974578  2.367354
9  2.608552  2.973542

In [316]:
# apply differnet non-aggregate function to different columns
def my_func(x):
    col1_new = x.col1.cumsum()
    col2_new = x.col2 * 2
    date = x.date
    ticker = x.ticker
    return pd.DataFrame({'ticker': ticker, 'col1_cumsum':col1_new, 'col2_2': col2_new, 'date':date})

df_t.groupby(['ticker']).apply(my_func)

   col1_cumsum    col2_2       date ticker
0     0.611022  0.930126 2016-07-25      A
1     1.167498  0.499785 2016-07-26      A
2     1.864846  1.668620 2016-07-27      A
3     2.733273  0.877229 2016-07-28      A
4     3.464981  1.819065 2016-07-29      A
5     0.016074  1.518609 2016-07-25      B
6     0.658600  1.052533 2016-07-26      B
7     1.457879  0.223265 2016-07-27      B
8     1.974578  1.940300 2016-07-28      B
9     2.608552  1.212376 2016-07-29      B

# Transformation

## dcast

In [242]:
df_t = pd.DataFrame({'date': pd.date_range('2016/07/25', periods=5).tolist() * 2
                  , 'ticker': ['A']*5 + ['B']*5
                  , 'col1': np.random.rand(10)
                  , 'col2': np.random.rand(10)})
print(df_t[['ticker', 'date', 'col1', 'col2']])

print(df_t.pivot_table(index='date', columns='ticker', values='col1').reset_index())

  ticker       date      col1      col2
0      A 2016-07-25  0.551251  0.415360
1      A 2016-07-26  0.578176  0.099689
2      A 2016-07-27  0.863598  0.453243
3      A 2016-07-28  0.087747  0.037609
4      A 2016-07-29  0.840936  0.611497
5      B 2016-07-25  0.244143  0.386107
6      B 2016-07-26  0.421040  0.478120
7      B 2016-07-27  0.616023  0.385456
8      B 2016-07-28  0.179030  0.193170
9      B 2016-07-29  0.533337  0.110533
ticker       date         A         B
0      2016-07-25  0.551251  0.244143
1      2016-07-26  0.578176  0.421040
2      2016-07-27  0.863598  0.616023
3      2016-07-28  0.087747  0.179030
4      2016-07-29  0.840936  0.533337

In [241]:
df_t_dcast = df_t.pivot_table(index='date', columns='ticker', values=['col1', 'col2']).reset_index()
print(df_t_dcast)
print(df_t_dcast.columns)
df_t_dcast.columns = ['{0}_{1}'.format(lv1, lv2) for lv1, lv2 in df_t_dcast.columns]
print(df_t_dcast)

             date      col1                col2
ticker                    A         B         A         B
0      2016-07-25  0.036315  0.446162  0.962582  0.380708
1      2016-07-26  0.039807  0.914333  0.026415  0.889065
2      2016-07-27  0.442656  0.434181  0.870239  0.030519
3      2016-07-28  0.439464  0.026301  0.842152  0.921363
4      2016-07-29  0.429947  0.209193  0.831693  0.412447
MultiIndex(levels=[[u'col1', u'col2', u'date'], [u'A', u'B', u'']],
           labels=[[2, 0, 0, 1, 1], [2, 0, 1, 0, 1]],
           names=[None, u'ticker'])
       date_    col1_A    col1_B    col2_A    col2_B
0 2016-07-25  0.036315  0.446162  0.962582  0.380708
1 2016-07-26  0.039807  0.914333  0.026415  0.889065
2 2016-07-27  0.442656  0.434181  0.870239  0.030519
3 2016-07-28  0.439464  0.026301  0.842152  0.921363
4 2016-07-29  0.429947  0.209193  0.831693  0.412447

## melt

In [226]:
print(pd.melt(df_t, id_vars=['date', 'ticker']))
print(pd.melt(df_t, id_vars=['date', 'ticker']).pivot_table(index='date', columns=['ticker', 'variable'], values='value'))

         date ticker variable     value
0  2016-07-25      A     col1  0.036315
1  2016-07-26      A     col1  0.039807
2  2016-07-27      A     col1  0.442656
3  2016-07-28      A     col1  0.439464
4  2016-07-29      A     col1  0.429947
5  2016-07-25      B     col1  0.446162
6  2016-07-26      B     col1  0.914333
7  2016-07-27      B     col1  0.434181
8  2016-07-28      B     col1  0.026301
9  2016-07-29      B     col1  0.209193
10 2016-07-25      A     col2  0.962582
11 2016-07-26      A     col2  0.026415
12 2016-07-27      A     col2  0.870239
13 2016-07-28      A     col2  0.842152
14 2016-07-29      A     col2  0.831693
15 2016-07-25      B     col2  0.380708
16 2016-07-26      B     col2  0.889065
17 2016-07-27      B     col2  0.030519
18 2016-07-28      B     col2  0.921363
19 2016-07-29      B     col2  0.412447
ticker             A                   B
variable        col1      col2      col1      col2
date
2016-07-25  0.036315  0.962582  0.446162  0.380708
2016-07-26  0.039807  0.026415  0.914333  0.889065
2016-07-27  0.442656  0.870239  0.434181  0.030519
2016-07-28  0.439464  0.842152  0.026301  0.921363
2016-07-29  0.429947  0.831693  0.209193  0.412447

In [240]:
df_t_dcast = df_t.pivot_table(index='date', columns='ticker', values=['col1', 'col2']).reset_index()
print(df_t_dcast)

df_t_melt = pd.melt(df_t_dcast, id_vars='date')
print(df_t_melt)

             date      col1                col2
ticker                    A         B         A         B
0      2016-07-25  0.036315  0.446162  0.962582  0.380708
1      2016-07-26  0.039807  0.914333  0.026415  0.889065
2      2016-07-27  0.442656  0.434181  0.870239  0.030519
3      2016-07-28  0.439464  0.026301  0.842152  0.921363
4      2016-07-29  0.429947  0.209193  0.831693  0.412447
         date   NaN ticker     value
0  2016-07-25  col1      A  0.036315
1  2016-07-26  col1      A  0.039807
2  2016-07-27  col1      A  0.442656
3  2016-07-28  col1      A  0.439464
4  2016-07-29  col1      A  0.429947
5  2016-07-25  col1      B  0.446162
6  2016-07-26  col1      B  0.914333
7  2016-07-27  col1      B  0.434181
8  2016-07-28  col1      B  0.026301
9  2016-07-29  col1      B  0.209193
10 2016-07-25  col2      A  0.962582
11 2016-07-26  col2      A  0.026415
12 2016-07-27  col2      A  0.870239
13 2016-07-28  col2      A  0.842152
14 2016-07-29  col2      A  0.831693
15 2016-07-25  col2      B  0.380708
16 2016-07-26  col2      B  0.889065
17 2016-07-27  col2      B  0.030519
18 2016-07-28  col2      B  0.921363
19 2016-07-29  col2      B  0.412447

# Apply / Map function to row / column / cell
.apply() is used on dataframe

.map() is used on series

In [266]:
# apply function to columns
df_t[['col1', 'col2']].apply(lambda x: np.cumsum(x))

       col1      col2
0  0.551251  0.415360
1  1.129427  0.515049
2  1.993024  0.968291
3  2.080772  1.005901
4  2.921708  1.617397
5  3.165851  2.003504
6  3.586892  2.481624
7  4.202915  2.867080
8  4.381945  3.060251
9  4.915281  3.170784

In [267]:
# apply function to rows
df_t[['col1', 'col2']].apply(lambda x: np.cumsum(x), axis=1)

       col1      col2
0  0.551251  0.966611
1  0.578176  0.677864
2  0.863598  1.316841
3  0.087747  0.125356
4  0.840936  1.452433
5  0.244143  0.630250
6  0.421040  0.899160
7  0.616023  1.001480
8  0.179030  0.372200
9  0.533337  0.643870

In [279]:
# apply a function to each cell in a dataframe
df_t[['col1', 'col2']].apply(lambda x: x*2)

       col1      col2       date ticker
0  0.551251  0.415360 2016-07-25      A
1  0.578176  0.099689 2016-07-26      A
2  0.863598  0.453243 2016-07-27      A
3  0.087747  0.037609 2016-07-28      A
4  0.840936  0.611497 2016-07-29      A
5  0.244143  0.386107 2016-07-25      B
6  0.421040  0.478120 2016-07-26      B
7  0.616023  0.385456 2016-07-27      B
8  0.179030  0.193170 2016-07-28      B
9  0.533337  0.110533 2016-07-29      B

       col1      col2
0  1.102501  0.830720
1  1.156352  0.199377
2  1.727196  0.906486
3  0.175494  0.075218
4  1.681873  1.222993
5  0.488287  0.772214
6  0.842081  0.956240
7  1.232047  0.770912
8  0.358059  0.386341
9  1.066673  0.221067

In [277]:
# apply a function to each cell in a series
df_t['col1'].map(lambda x: x*2)

0    1.102501
1    1.156352
2    1.727196
3    0.175494
4    1.681873
5    0.488287
6    0.842081
7    1.232047
8    0.358059
9    1.066673
Name: col1, dtype: float64

# From dataframe to Dict / Array

In [260]:
# dataframe to array
df_t.values

array([[0.5512507245585277, 0.4153600145816705,
        Timestamp('2016-07-25 00:00:00'), 'A'],
       [0.5781758143099083, 0.09968854450741127,
        Timestamp('2016-07-26 00:00:00'), 'A'],
       [0.8635978714278528, 0.4532428715732,
        Timestamp('2016-07-27 00:00:00'), 'A'],
       [0.0877472407774823, 0.037609172653104816,
        Timestamp('2016-07-28 00:00:00'), 'A'],
       [0.8409362698253112, 0.6114967004135908,
        Timestamp('2016-07-29 00:00:00'), 'A'],
       [0.24414337068370573, 0.3861069749804985,
        Timestamp('2016-07-25 00:00:00'), 'B'],
       [0.421040481312842, 0.4781197521175531,
        Timestamp('2016-07-26 00:00:00'), 'B'],
       [0.616023405006736, 0.38545619992058133,
        Timestamp('2016-07-27 00:00:00'), 'B'],
       [0.17902964281000178, 0.19317032433641224,
        Timestamp('2016-07-28 00:00:00'), 'B'],
       [0.5333365991465155, 0.1105334537611099,
        Timestamp('2016-07-29 00:00:00'), 'B']], dtype=object)

In [259]:
# dataframe to array 2
df_t.as_matrix()

array([[0.5512507245585277, 0.4153600145816705,
        Timestamp('2016-07-25 00:00:00'), 'A'],
       [0.5781758143099083, 0.09968854450741127,
        Timestamp('2016-07-26 00:00:00'), 'A'],
       [0.8635978714278528, 0.4532428715732,
        Timestamp('2016-07-27 00:00:00'), 'A'],
       [0.0877472407774823, 0.037609172653104816,
        Timestamp('2016-07-28 00:00:00'), 'A'],
       [0.8409362698253112, 0.6114967004135908,
        Timestamp('2016-07-29 00:00:00'), 'A'],
       [0.24414337068370573, 0.3861069749804985,
        Timestamp('2016-07-25 00:00:00'), 'B'],
       [0.421040481312842, 0.4781197521175531,
        Timestamp('2016-07-26 00:00:00'), 'B'],
       [0.616023405006736, 0.38545619992058133,
        Timestamp('2016-07-27 00:00:00'), 'B'],
       [0.17902964281000178, 0.19317032433641224,
        Timestamp('2016-07-28 00:00:00'), 'B'],
       [0.5333365991465155, 0.1105334537611099,
        Timestamp('2016-07-29 00:00:00'), 'B']], dtype=object)

In [262]:
# dataframe to dict by column
df_t.to_dict()

{'col1': {0: 0.55125072455852775,
  1: 0.57817581430990828,
  2: 0.86359787142785283,
  3: 0.087747240777482305,
  4: 0.84093626982531122,
  5: 0.24414337068370573,
  6: 0.421040481312842,
  7: 0.61602340500673602,
  8: 0.17902964281000178,
  9: 0.53333659914651554},
 'col2': {0: 0.41536001458167049,
  1: 0.09968854450741127,
  2: 0.45324287157319998,
  3: 0.037609172653104816,
  4: 0.61149670041359083,
  5: 0.38610697498049851,
  6: 0.47811975211755309,
  7: 0.38545619992058133,
  8: 0.19317032433641224,
  9: 0.1105334537611099},
 'date': {0: Timestamp('2016-07-25 00:00:00'),
  1: Timestamp('2016-07-26 00:00:00'),
  2: Timestamp('2016-07-27 00:00:00'),
  3: Timestamp('2016-07-28 00:00:00'),
  4: Timestamp('2016-07-29 00:00:00'),
  5: Timestamp('2016-07-25 00:00:00'),
  6: Timestamp('2016-07-26 00:00:00'),
  7: Timestamp('2016-07-27 00:00:00'),
  8: Timestamp('2016-07-28 00:00:00'),
  9: Timestamp('2016-07-29 00:00:00')},
 'ticker': {0: 'A',
  1: 'A',
  2: 'A',
  3: 'A',
  4: 'A',
  5: 'B',
  6: 'B',
  7: 'B',
  8: 'B',
  9: 'B'}}

In [263]:
# dataframe to dict by row
df_t.T.to_dict()

{0: {'col1': 0.5512507245585277,
  'col2': 0.4153600145816705,
  'date': Timestamp('2016-07-25 00:00:00'),
  'ticker': 'A'},
 1: {'col1': 0.5781758143099083,
  'col2': 0.09968854450741127,
  'date': Timestamp('2016-07-26 00:00:00'),
  'ticker': 'A'},
 2: {'col1': 0.8635978714278528,
  'col2': 0.4532428715732,
  'date': Timestamp('2016-07-27 00:00:00'),
  'ticker': 'A'},
 3: {'col1': 0.0877472407774823,
  'col2': 0.037609172653104816,
  'date': Timestamp('2016-07-28 00:00:00'),
  'ticker': 'A'},
 4: {'col1': 0.8409362698253112,
  'col2': 0.6114967004135908,
  'date': Timestamp('2016-07-29 00:00:00'),
  'ticker': 'A'},
 5: {'col1': 0.24414337068370573,
  'col2': 0.3861069749804985,
  'date': Timestamp('2016-07-25 00:00:00'),
  'ticker': 'B'},
 6: {'col1': 0.421040481312842,
  'col2': 0.4781197521175531,
  'date': Timestamp('2016-07-26 00:00:00'),
  'ticker': 'B'},
 7: {'col1': 0.616023405006736,
  'col2': 0.38545619992058133,
  'date': Timestamp('2016-07-27 00:00:00'),
  'ticker': 'B'},
 8: {'col1': 0.17902964281000178,
  'col2': 0.19317032433641224,
  'date': Timestamp('2016-07-28 00:00:00'),
  'ticker': 'B'},
 9: {'col1': 0.5333365991465155,
  'col2': 0.1105334537611099,
  'date': Timestamp('2016-07-29 00:00:00'),
  'ticker': 'B'}}